# Ultralytics YOLO 🚀, AGPL-3.0 license
# NanoVerse-YOLO based on YOLOv10n
# 特点：集成 SPD-Conv 和 P2 小目标检测头

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2

  # === 修改点：使用 SPDConv 替代 Conv 进行下采样，保留细粒度特征 ===
  - [-1, 1, SPDConv, [128]]    # 1-P2/4
  - [-1, 3, C2f, [128, True]]

  - [-1, 1, SPDConv, [256]]    # 3-P3/8
  - [-1, 6, C2f, [256, True]]

  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]

  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 15

  # === 修改点：增加 P2 小目标融合路径 ===
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2 (SPDConv后的高分辨率特征)
  - [-1, 3, C2f, [128]] # 18 (P2 特征层)

  # Detect Head 增加了 P2 层输入
  # args: [nc, anchors (optional)]
  # 输入层变为 [18(P2), 15(P3), 12(P4)]，我们去掉了 P5 以节省算力并专注小目标
  - [[18, 15, 12], 1, v10Detect, [nc]]